pokemon_api/app/controllers/pokemons_controller.rb

INSERT INTO "pokemons" ("name", "type1", "attack", "defense", "speed", "legendary", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @pokemon = Pokemon.create(pokemon_params)

UPDATE "pokemons" SET "hitpoints" = $1, "updated_at" = $2 WHERE "pokemons"."id" = $3  [["hitpoints", 80000], ["updated_at", "2019-01-23 13:15:07.191972"], ["id", 152]]
---
  def update
    @pokemon.update_attributes(pokemon_params)

DELETE FROM "pokemons" WHERE "pokemons"."id" = $1  [["id", 51]]
---
  def destroy
    @pokemon.destroy

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
---
  def set_pokemon
    @pokemon = Pokemon.find(params[:id])